# 5 Membalik urutan baris dan kolom pada Data Frame

### Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  8  8  3  1  3
1  9  7  4  1  8
2  1  2  5  6  3
3  3  8  6  9  3
4  8  5  4  9  9

### Membalik urutan kolom

In [4]:
df.loc[:, ::-1]

   E  D  C  B  A
0  3  1  3  8  8
1  8  1  4  7  9
2  3  6  5  2  1
3  3  9  6  8  3
4  9  9  4  5  8

In [ ]:
# didalam siku, dibagi menjadi dua yaitu :
# (:) untuk mengatur baris
# (::-1) untuk mengatur kolom
# (-1) untuk mengatur stepper, pembalikan urutan(-)

### Membalik urutan baris

In [5]:
df.loc[::-1]

   A  B  C  D  E
4  8  5  4  9  9
3  3  8  6  9  3
2  1  2  5  6  3
1  9  7  4  1  8
0  8  8  3  1  3

### Membalik urutan baris dan melakukan penyesuaian ulang index

In [ ]:
df.loc[::-1].reset_index(drop=True)

urutannya barisnya tetap terbalik tetapi indexnya dibuat ulang